Revit 2027 API
Category.GetCategory(Document, BuiltInCategory) Method
Retrieves a category object corresponding to a BuiltInCategory id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Category GetCategory(
	Document document,
	BuiltInCategory categoryId
)
Public Shared Function GetCategory (
	document As Document,
	categoryId As BuiltInCategory
) As Category
public:
static Category^ GetCategory(
	Document^ document,
	BuiltInCategory categoryId
)
static member GetCategory :
        document : Document *
        categoryId : BuiltInCategory -> Category
Parameters
document Document
The document.
categoryId BuiltInCategory
A built in category id.
Return Value
Category
Returns a category object corresponding to a BuiltInCategory id.
See Also
Reference
Category Class
GetCategory Overload
Autodesk.Revit.DB Namespace